1) importing
   Bringing data into your Python program from outside


File Type   | Function        | Example
CSV         | pd.read_csv()   | pd.read_csv("data.csv")
Excel       | pd.read_excel() | pd.read_excel("data.xlsx")
JSON        | pd.read_json()  | pd.read_json("data.json")
SQL         | pd.read_sql()   | From a SQL connection
Text        | pd.read_table() | pd.read_table("data.txt")

In [5]:
import pandas as pd

pd.read_csv(filename): Read data from a CSV file.

In [2]:
datacsv = pd.read_csv("laptops_dataset.csv")

In [3]:
tails = datacsv.tail()
tails

,product_name,overall_rating,no_ratings,no_reviews,rating,title,review
24108,MSI Modern 14 Intel Core i5 13th Gen 1335U - (...,4.3,156,24,5,Perfect product!,MSI Laptop is high performance and the best. c...
24109,MSI Modern 14 Intel Core i5 13th Gen 1335U - (...,4.3,156,24,5,Perfect product!,Excellent performance best laptop.
24110,MSI Modern 14 Intel Core i5 13th Gen 1335U - (...,4.3,156,24,4,"Good product, Lacks features.",Decent battery life. Exceptional build quality...
24111,Lenovo IdeaPad 5 2-in-1 WUXGA IPS AMD Ryzen 7 ...,4.4,7,2,3,Nice,The product does not support facial recognitio...
24112,Lenovo IdeaPad 5 2-in-1 WUXGA IPS AMD Ryzen 7 ...,4.4,7,2,4,Very Good,DISPLAY IS A LET DOWN. But the lenovo Pen work...

In [4]:
head = datacsv.head(10)
head

,product_name,overall_rating,no_ratings,no_reviews,rating,title,review
0,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Perfect product!,"Loved it, it's my first MacBook that I earned ..."
1,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Fabulous!,Battery lasted longer than my first relationsh...
2,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Fabulous!,Such a great deal.. very happy with the perfor...
3,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,4,Delightful,"Awesome build quality and very good display, b..."
4,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Awesome,When i ordered and came to know about seller r...
5,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Super!,Super product
6,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Super!,Go for it..its awesome
7,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Mind-blowing purchase,"Best , best and best ü´∂üèªüëëüçé"
8,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Just wow!,Its really very good and compact device.
9,Apple MacBook AIR Apple M2 - (8 GB/256 GB SSD/...,4.7,"15,210",900,5,Brilliant,"Superb built quality, Amazing performance and ..."

pd.read_json(json_string): Read data from a JSON formatted string, URL, or file

In [5]:
datajson = pd.read_json("https://raw.githubusercontent.com/LordMelodias/Scrapy/refs/heads/main/book_scraper/book.json")

In [6]:
heads = datajson.head()
heads

                                   title   price availability rating
0                   A Light in the Attic  ¬£51.77     In stock  Three
1                     Tipping the Velvet  ¬£53.74     In stock    One
2                             Soumission  ¬£50.10     In stock    One
3                          Sharp Objects  ¬£47.82     In stock   Four
4  Sapiens: A Brief History of Humankind  ¬£54.23     In stock   Five

pd.read_excel(filename): Read data from an Excel file.

In [9]:
exceldata = pd.read_excel("Coffee.xlsx")

In [11]:
head = exceldata.head()
head

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,1,2023-01-01,07:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg
1,2,2023-01-01,07:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
2,3,2023-01-01,07:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg
3,4,2023-01-01,07:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm
4,5,2023-01-01,07:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg

Make SQL Connection

In [ ]:
from sqlalchemy import create_engine

engine = create_engine("mysql+mysqlconnector://root:root@localhost/test")

pd.read_sql(query, connection_object): Read data from a SQL table/database.

In [28]:
sqldata = pd.read_sql("SELECT * FROM employee", engine)

In [29]:
head = sqldata.head()
head

   id           name  age   department   salary
0   1  Alice Johnson   28           HR  50000.0
1   2      Bob Smith   35  Engineering  75000.0
2   3    Charlie Lee   30    Marketing  60000.0
3   4    Diana Brown   40      Finance  80000.0
4   5   Ethan Wilson   25      Support  40000.0

pd.read_table(filename): Read data from a delimited text file.

In [30]:
datatable = pd.read_table("data.txt")

In [31]:
heads = datatable.head()
heads

      Name  Age         City
0    Alice   24     New York
1      Bob   30  Los Angeles
2  Charlie   28      Chicago
3    David   35      Houston
4      Eve   22      Phoenix

2. Exporting: Saving data from your Python program to an external file.

df.to_csv(filename): Write to a CSV file

In [19]:
datatable.to_csv("ouputcsv.csv")

df.to_excel(filename): Write to an Excel file.

In [20]:
datatable.to_excel("ouputexcle.xlsx")

df.to_sql(table_name, connection_object): Write to a SQL table.

In [ ]:
datatable.to_sql(name='people', con=engine, if_exists='replace', index=False)

-1

df.to_json(filename): Write to a file in JSON format

In [32]:
datatable.to_json("output.json")